burgrp/py32-svd/svd/py32m070cxx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Puya</vendor>
  <vendorID>Puya</vendorID>
  <name>PY32M070Cxx</name>
  <series>PY32M</series>
  <version>1.0.0</version>
  <description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>AWD</name>
              <description>desc AWD</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EOC</name>
              <description>desc EOC</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>JEOC</name>
              <description>desc JEOC</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>JSTRT</name>
              <description>desc JSTRT</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>STRT</name>
              <description>desc STRT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OVER</name>
              <description>desc OVER</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>AWDCH</name>
              <description>desc AWDCH</description>
              <bitRange>[4:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOCIE</name>
              <description>desc EOCIE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AWDIE</name>
              <description>desc AWDIE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>JEOCIE</name>
              <description>desc JEOCIE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <description>desc SCAN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AWDSGL</name>
              <description>desc AWDSGL</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>JAUTO</name>
              <description>desc JAUTO</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DISCEN</name>
              <description>desc DISCEN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>JDISCEN</name>
              <description>desc JDISCEN</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DISCNUM</name>
              <description>desc DISCNUM</description>
              <bitRange>[15:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JAWDEN</name>
              <description>desc JAWDEN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AWDEN</name>
              <description>desc AWDEN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RESSEL</name>
              <description>desc RESSEL</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADSTP</name>
              <description>desc ADSTP</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OVETIE</name>
              <description>desc OVETIE</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADON</name>
              <description>desc ADON</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CONT</name>
              <description>desc CONT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAL</name>
              <description>desc CAL</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSTCAL</name>
              <description>desc RSTCAL</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMA</name>
              <description>desc DMA</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ALIGN</name>
              <description>desc ALIGN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>desc JEXTSEL</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEXTTRIG</name>
              <description>desc JEXTTRIG</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>desc EXTSEL</description>
              <bitRange>[19:17]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTTRIG</name>
              <description>desc EXTTRIG</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>JSWSTART</name>
              <description>desc JSWSTART</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SWSTART</name>
              <description>desc SWSTART</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TSVREFE</name>
              <description>desc TSVREFE</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>VERFBUFFERE</name>
              <description>desc VERFBUFFERE</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>VERFBUFFERSEL</name>
              <description>desc VERFBUFFERSEL</description>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>desc SMPR1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SMP20</name>
              <description>desc SMP20</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP21</name>
              <description>desc SMP21</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP22</name>
              <description>desc SMP22</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP23</name>
              <description>desc SMP23</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <description>desc SMPR2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>SMP10</name>
              <description>desc SMP10</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP11</name>
              <description>desc SMP11</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP12</name>
              <description>desc SMP12</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP13</name>
              <description>desc SMP13</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP14</name>
              <description>desc SMP14</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP15</name>
              <description>desc SMP15</description>
              <bitRange>[17:15]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP16</name>
              <description>desc SMP16</description>
              <bitRange>[20:18]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP17</name>
              <description>desc SMP17</description>
              <bitRange>[23:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP18</name>
              <description>desc SMP18</description>
              <bitRange>[26:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP19</name>
              <description>desc SMP19</description>
              <bitRange>[29:27]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
