burgrp/py32-svd/svd/py32m070cxx.svd
        <register>
          <name>PERTPE</name>
          <description>desc PERTPE</description>
          <addressOffset>0x114</addressOffset>
          <resetValue>0xEA60</resetValue>
          <fields>
            <field>
              <name>PERTPE</name>
              <description>desc PERTPE</description>
              <bitRange>[16:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>65536</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMERTPE</name>
          <description>desc SMERTPE</description>
          <addressOffset>0x118</addressOffset>
          <resetValue>0xFD20</resetValue>
          <fields>
            <field>
              <name>SMERTPE</name>
              <description>desc SMERTPE</description>
              <bitRange>[16:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <value>65536</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <description>desc PRGTPE</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x8CA0</resetValue>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>desc PRGTPE</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <value>32768</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <description>desc PRETPE</description>
          <addressOffset>0x120</addressOffset>
          <resetValue>0x12C0</resetValue>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>desc PRETPE</description>
              <bitRange>[13:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <value>8192</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
