burgrp/py32-svd/svd/py32m070cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>General-purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>GPIO port mode register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0xEBFFFFFF</resetValue>
          <fields>
            <field>
              <name>MODE0</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE1</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE2</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE3</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE4</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE5</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE6</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE7</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE8</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE9</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[19:18]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE10</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE11</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[23:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE12</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE13</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE14</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE15</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[31:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>GPIO port output type register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OT0</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OT1</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OT2</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OT3</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OT4</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OT5</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OT6</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OT7</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OT8</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OT9</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OT10</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OT11</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OT12</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OT13</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OT14</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>OT15</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>GPIO port output speed register</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0xC000000</resetValue>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[19:18]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[23:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>Port x configuration bits (y=0-15)</description>
              <bitRange>[31:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
