burgrp/py32-svd/svd/py32m070cxx.svd
        <register>
          <name>LCKR</name>
          <displayName>LCKR</displayName>
          <description>GPIO port configuration lock register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCK6</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCK7</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCK8</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCK9</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LCK10</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LCK11</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LCK12</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LCK13</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LCK14</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LCK15</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>Port x lock (LCKK)</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <displayName>AFRL</displayName>
          <description>GPIO alternate function low register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[19:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <displayName>AFRH</displayName>
          <description>GPIO alternate function high register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[19:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <displayName>BRR</displayName>
          <description>port bit reset register</description>
          <addressOffset>0x28</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>BR0</name>
              <description>Port Reset bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>Port Reset bit</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>Port Reset bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>Port Reset bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>Port Reset bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>Port Reset bit</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>Port Reset bit</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>Port Reset bit</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>Port Reset bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>Port Reset bit</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>Port Reset bit</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>Port Reset bit</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BR12</name>
              <description>Port Reset bit</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BR13</name>
              <description>Port Reset bit</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BR14</name>
              <description>Port Reset bit</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BR15</name>
              <description>Port Reset bit</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
