burgrp/py32-svd/svd/py32m070cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x30000</resetValue>
          <fields>
            <field>
              <name>BIAS_CR</name>
              <description>MR Bias current</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BIAS_CR_SEL</name>
              <description>MR Bias current selection</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write protection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling range selection</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <description>Flash wait time after wakeup from the stop mode</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPR</name>
              <description>Low-power run</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <description>HSI open time control</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x500</resetValue>
          <fields>
            <field>
              <name>PVDE</name>
              <description>Power voltage detector enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SRCSEL</name>
              <description>Power voltage detector volatage selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PVDT</name>
              <description>Power voltage detector threshold selection</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTEN</name>
              <description>Digital filter enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_TIME</name>
              <description>Digital filter time configuration</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Power status register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PVDO</name>
              <description>PVD output</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC and CTC global Interrupts</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Clock control register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>HSION</name>
              <description>HSI16 clock enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSI16 clock ready flag</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HSIDIV</name>
              <description>HSI16 clock division factor</description>
              <bitRange>[13:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSEON</name>
              <description>HSE clock enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSE clock ready flag</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>HSE crystal oscillator bypass</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSSON</name>
              <description>Clock security system enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADC_DIV</name>
              <description>ADC Frequency Division</description>
              <bitRange>[22:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLON</name>
              <description>PLL enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>PLL clock ready flag</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <displayName>ICSCR</displayName>
          <description>Internal clock sources calibration register</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>HSI_TRIM</name>
              <description>HSI clock trimming</description>
              <bitRange>[12:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <value>4096</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSI_FS</name>
              <description>HSI frequency selection</description>
              <bitRange>[15:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Freq24MHz</name>
                  <description>24 MHz HSI clock</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSI_TRIM</name>
              <description>LSI clock trimming</description>
              <bitRange>[24:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <value>256</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <description>System clock switch</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWS</name>
              <description>System clock switch status</description>
              <bitRange>[5:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI used as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE used as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>PLL used as system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI used as system clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE used as system clock</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPRE</name>
              <description>AHB prescaler</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE</name>
              <description>APB prescaler</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCOSEL</name>
              <description>Microcontroller clock output</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>MCOPRE</name>
              <description>Microcontroller clock output prescaler</description>
              <bitRange>[30:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>PLL configuration register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>PLL clock source selection</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock sent to PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI source clock selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE source clock selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLMUL</name>
              <description>PLLMUL</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <displayName>ECSCR</displayName>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <description>HSE_DRV</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_STARTUP</name>
              <description>HSE_STARTUP</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSE_DRIVER</name>
              <description>LSE clock driver selection</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSE_STARTUP</name>
              <description>LSE_STARTUP</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
