burgrp/py32-svd/svd/py32m070cxx.svd
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>Clock interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI ready interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE ready interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI ready interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE ready interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL ready interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <displayName>CIFR</displayName>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI ready interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE ready interrupt flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI ready interrupt flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE ready interrupt flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLL ready interrupt flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSF</name>
              <description>HSE clock secure system interrupt flag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE clock secure system interrupt flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <displayName>CICR</displayName>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>LSI ready interrupt clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>LSE ready interrupt clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>HSI ready interrupt clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>HSE ready interrupt clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>PLL ready interrupt clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSC</name>
              <description>clock secure system interrupt flag clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSC</name>
              <description>LSE clock secure system interrupt flag clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <displayName>IOPRSTR</displayName>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <description>I/O port A reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <description>I/O port B reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCRST</name>
              <description>I/O port F reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIOFRST</name>
              <description>I/O port F reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <displayName>AHBRSTR</displayName>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <description>DMA reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <description>CRC reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIVRST</name>
              <description>DIV reset</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <displayName>APBRSTR1</displayName>
          <description>APB peripheral reset register 1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TIM2RST</name>
              <description>TIM2 timer reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3RST</name>
              <description>TIM3 timer reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM6RST</name>
              <description>TIM6 timer reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7RST</name>
              <description>TIM7 timer reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCAPBRST</name>
              <description>RTCAPB reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGRST</name>
              <description>WWDG reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <description>SPI2 reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USART2RST</name>
              <description>USART2 reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>USART3RST</name>
              <description>USART3 reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>USART4RST</name>
              <description>USART4 reset</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <description>I2C1 reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2RST</name>
              <description>I2C2 reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <description>USB reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CANRST</name>
              <description>CANRST</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CTCRST</name>
              <description>CTCRST</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <description>Power interface reset</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACRST</name>
              <description>DACRST</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPARST</name>
              <description>OPARST</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LPTIMRST</name>
              <description>Low Power Timer reset</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <displayName>APBRSTR2</displayName>
          <description>APB peripheral reset register 2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>SYSCFG reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCRST</name>
              <description>ADC reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DBGRST</name>
              <description>DBG reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>TIM1 reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>SPI1 reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <description>USART1 reset</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>TIM14 reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM15RST</name>
              <description>TIM15 reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <description>TIM16 reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <description>TIM17 reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>COMP1RST</name>
              <description>COMP1 reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP2RST</name>
              <description>COMP2 reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP3RST</name>
              <description>COMP3 reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCDRST</name>
              <description>LCD reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPENR</name>
          <displayName>IOPENR</displayName>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <description>I/O port A clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <description>I/O port B clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCEN</name>
              <description>I/O port C clock enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIOFEN</name>
              <description>I/O port F clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR</name>
          <displayName>AHBENR</displayName>
          <description>AHB peripheral clock enable register</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASHEN</name>
              <description>Flash memory interface clock enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRAMEN</name>
              <description>SRAM memory interface clock enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <description>CRC clock enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIVEN</name>
              <description>DIVEN</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR1</name>
          <displayName>APBENR1</displayName>
          <description>APB peripheral clock enable register 1</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>TIM2EN</name>
              <description>TIM2 timer clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3EN</name>
              <description>TIM3 timer clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM6EN</name>
              <description>TIM6 timer clock enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7EN</name>
              <description>TIM7 timer clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMDIVEN</name>
              <description>desc TIMDIVEN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <description>WWDG clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <description>SPI2 clock enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USART2EN</name>
              <description>USART2 clock enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>USART3EN</name>
              <description>USART3 clock enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>USART4EN</name>
              <description>USART4 clock enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>I2C1 clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2EN</name>
              <description>I2C2 clock enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>USBEN</name>
              <description>USB clock enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CANEN</name>
              <description>CAN clock enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CTCEN</name>
              <description>CTC clock enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <description>Power interface clock enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DACEN</name>
              <description>DAC clock enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPAEN</name>
              <description>OPA clock enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LPTIMEN</name>
              <description>LPTIM clock enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR2</name>
          <displayName>APBENR2</displayName>
          <description>APB peripheral clock enable register 2</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>SYSCFG, COMP and VREFBUF clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADCEN clock enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DBGEN</name>
              <description>DBG clock enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>TIM1 clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>SPI1 clock enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <description>USART1 clock enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14EN</name>
              <description>TIM14 clock enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM15EN</name>
              <description>TIM15 clock enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <description>TIM16 clock enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <description>TIM17 clock enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 clock enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP3EN</name>
              <description>COMP3 clock enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCDEN</name>
              <description>LCD clock enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <displayName>CCIPR</displayName>
          <description>Peripherals independent clock configuration register</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>CANSEL</name>
              <description>CAN detect clock source selection</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PVDSEL</name>
              <description>PVD detect clock source selection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <description>COMP1 clock source selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <description>COMP2 clock source selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>COMP3SEL</name>
              <description>COMP3 clock source selection</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1 clock source selection</description>
              <bitRange>[19:18]</bitRange>
            </field>
          </fields>
        </register>
