burgrp/py32-svd/svd/py32m070cxx.svd
        <register>
          <name>BDCR</name>
          <displayName>BDCR</displayName>
          <description>RTC domain control register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LSEON</name>
              <description>LSE oscillator enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSE oscillator ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>LSE oscillator bypass</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSECSSON</name>
              <description>LSE CSS enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LSECSSD</name>
              <description>LSE CSS detect</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>RTC clock source selection</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC clock source enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <description>RTC domain software reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSCOEN</name>
              <description>Low-speed clock output (LSCO) enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>LSCOSEL</name>
              <description>Low-speed clock output selection</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSI oscillator enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI oscillator ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NRST_FLTDIS</name>
              <description>NRST_FLTDIS oscillator ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RMVF</name>
              <description>Remove reset flags</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loader reset flag</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PWRRSTF</name>
              <description>BOR or POR/PDR flag</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Software reset flag</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>Independent window watchdog reset flag</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>Window watchdog reset flag</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>desc RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC Interrupt through EXTI Lines 19</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CRH</name>
          <description>desc CRH</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SECIE</name>
              <description>desc SECIE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRIE</name>
              <description>desc ALRIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWIE</name>
              <description>desc OWIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRL</name>
          <description>desc CRL</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>SECF</name>
              <description>desc SECF</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRF</name>
              <description>desc ALRF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWF</name>
              <description>desc OWF</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSF</name>
              <description>desc RSF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNF</name>
              <description>desc CNF</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RTOFF</name>
              <description>desc RTOFF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLH</name>
          <description>desc PRLH</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>PRL</name>
              <description>desc PRL</description>
              <bitRange>[3:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLL</name>
          <description>desc PRLL</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <resetValue>0x8000</resetValue>
          <fields>
            <field>
              <name>PRL</name>
              <description>desc PRL</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVH</name>
          <description>desc DIVH</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVL</name>
          <description>desc DIVL</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <resetValue>0x8000</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTH</name>
          <description>desc CNTH</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>desc RTC_CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <description>desc CNTL</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>desc RTC_CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRH</name>
          <description>desc ALRH</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <fields>
            <field>
              <name>RTC_ALR</name>
              <description>desc RTC_ALR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRL</name>
          <description>desc ALRL</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <fields>
            <field>
              <name>RTC_ALR</name>
              <description>desc RTC_ALR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP_RTCCR</name>
          <description>desc BKP_RTCCR</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>CAL</name>
              <description>desc CAL</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>CCO</name>
              <description>desc CCO</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ASOE</name>
              <description>desc ASOE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ASOS</name>
              <description>desc ASOS</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
