burgrp/py32-svd/svd/py32m070cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM15</name>
      <baseAddress>0x40014000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM15</name>
        <description>TIM15 global Interrupt</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>CEN</name>
              <description>desc CEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <description>desc UDIS</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <description>desc URS</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <description>desc OPM</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <description>desc CMS</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <description>desc ARPE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKD</name>
              <description>desc CKD</description>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x4</addressOffset>
          <resetMask>0xF8</resetMask>
          <fields>
            <field>
              <name>CCDS</name>
              <description>desc CCDS</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MMS</name>
              <description>desc MMS</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TI1S</name>
              <description>desc TI1S</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>desc SMCR</description>
          <addressOffset>0x8</addressOffset>
          <resetMask>0xFFF7</resetMask>
          <fields>
            <field>
              <name>SMS</name>
              <description>desc SMS</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>TS</name>
              <description>desc TS</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MSM</name>
              <description>desc MSM</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ETF</name>
              <description>desc ETF</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ETPS</name>
              <description>desc ETPS</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>ECE</name>
              <description>desc ECE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ETP</name>
              <description>desc ETP</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>desc DIER</description>
          <addressOffset>0xC</addressOffset>
          <resetMask>0x5F5F</resetMask>
          <fields>
            <field>
              <name>UIE</name>
              <description>desc UIE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IE</name>
              <description>desc CC1IE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IE</name>
              <description>desc CC2IE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IE</name>
              <description>desc CC3IE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IE</name>
              <description>desc CC4IE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIE</name>
              <description>desc TIE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <description>desc UDE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1DE</name>
              <description>desc CC1DE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2DE</name>
              <description>desc CC2DE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3DE</name>
              <description>desc CC3DE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4DE</name>
              <description>desc CC4DE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TDE</name>
              <description>desc TDE</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <resetMask>0x1E5F</resetMask>
          <fields>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IF</name>
              <description>desc CC2IF</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IF</name>
              <description>desc CC3IF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IF</name>
              <description>desc CC4IF</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIF</name>
              <description>desc COMIF</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIF</name>
              <description>desc TIF</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIF</name>
              <description>desc BIF</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2OF</name>
              <description>desc CC2OF</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3OF</name>
              <description>desc CC3OF</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4OF</name>
              <description>desc CC4OF</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IC1IR</name>
              <description>desc IC1IR</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC2IR</name>
              <description>desc IC2IR</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IC3IR</name>
              <description>desc IC3IR</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IC4IR</name>
              <description>desc IC3IR</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <description>desc IC1IF</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <description>desc IC2IF</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <description>desc IC3IF</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <description>desc IC3IF</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>desc EGR</description>
          <addressOffset>0x14</addressOffset>
          <access>write-only</access>
          <resetMask>0x5F</resetMask>
          <fields>
            <field>
              <name>UG</name>
              <description>desc UG</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC1G</name>
              <description>Capture/Compare 1 Generation</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC2G</name>
              <description>desc CC2G</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC3G</name>
              <description>desc CC3G</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC4G</name>
              <description>desc CC4G</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TG</name>
              <description>desc TG</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_OUTPUT</name>
          <description>desc CCMR1:OUTPUT</description>
          <addressOffset>0x18</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1FE</name>
              <description>desc OC1FE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <description>desc OC1PE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC1M</name>
              <description>desc OC1M</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC1CE</name>
              <description>desc OC1CE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC2FE</name>
              <description>desc OC2FE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC2PE</name>
              <description>desc OC2PE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2M</name>
              <description>desc OC2M</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC2CE</name>
              <description>desc OC2CE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_INPUT</name>
          <description>desc CCMR1:INPUT</description>
          <alternateRegister>CCMR1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC1PSC</name>
              <description>desc IC1PSC</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC1F</name>
              <description>desc IC1F</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2PSC</name>
              <description>desc IC2PSC</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC2F</name>
              <description>desc IC2F</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER</name>
          <description>desc CCER</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x3333</resetMask>
          <fields>
            <field>
              <name>CC1E</name>
              <description>desc CC1E</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <description>desc CC1P</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2E</name>
              <description>desc CC2E</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CC2P</name>
              <description>desc CC2P</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CC3E</name>
              <description>desc CC3E</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC3P</name>
              <description>desc CC3P</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC4E</name>
              <description>desc CC4E</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CC4P</name>
              <description>desc CC4P</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>desc CNT</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>desc PSC</description>
          <addressOffset>0x28</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PSC</name>
              <description>desc PSC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>desc ARR</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ARR</name>
              <description>desc ARR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>desc RCR</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REP</name>
              <description>desc REP</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR1</name>
              <description>desc CCR1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x38</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR2</name>
              <description>desc CCR2</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>desc BDTR</description>
          <addressOffset>0x44</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DTG</name>
              <description>desc DTG</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>desc LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <description>desc OSSI</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <description>desc OSSR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <description>desc BKE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <description>desc BKP</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <description>desc AOE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <description>desc MOE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>desc DCR</description>
          <addressOffset>0x48</addressOffset>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>DBA</name>
              <description>desc DBA</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <description>desc DBL</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>desc DMAR</description>
          <addressOffset>0x4C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DMAB</name>
              <description>desc DMAB</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
